InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/DMA/Header/Peripheral/Register/RegisterDefines/DMA_RegisterDefines_CHASGN.h
/**
 *
 * @file DMA_RegisterDefines_CHASGN.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 28 jul. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 28 jul. 2020     vyldram    1.0         initial Version@endverbatim
 */
#ifndef XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERDEFINES_DMA_REGISTERDEFINES_CHASGN_H_
#define XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERDEFINES_DMA_REGISTERDEFINES_CHASGN_H_

#include <stdint.h>

/**************************************************************************************
************************************* 21 DMACHASGN *************************************
****************************************************************************************/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN0_MASK        ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_R_CHASGN0_BIT         ((uint32_t)0u)
#define DMA_DMACHASGN_R_CHASGN0_PRIMARY     ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN0_SECUNDARY   ((uint32_t)0x00000001u)

#define DMA_DMACHASGN_CHASGN0_MASK          ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN0_PRIMARY       ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN0_SECUNDARY     ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN1_MASK        ((uint32_t)0x00000002u)
#define DMA_DMACHASGN_R_CHASGN1_BIT         ((uint32_t)1u)
#define DMA_DMACHASGN_R_CHASGN1_PRIMARY     ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN1_SECUNDARY   ((uint32_t)0x00000002u)

#define DMA_DMACHASGN_CHASGN1_MASK          ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN1_PRIMARY       ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN1_SECUNDARY     ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN2_MASK        ((uint32_t)0x00000004u)
#define DMA_DMACHASGN_R_CHASGN2_BIT         ((uint32_t)2u)
#define DMA_DMACHASGN_R_CHASGN2_PRIMARY     ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN2_SECUNDARY   ((uint32_t)0x00000004u)

#define DMA_DMACHASGN_CHASGN2_MASK          ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN2_PRIMARY       ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN2_SECUNDARY     ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN3_MASK        ((uint32_t)0x00000008u)
#define DMA_DMACHASGN_R_CHASGN3_BIT         ((uint32_t)3u)
#define DMA_DMACHASGN_R_CHASGN3_PRIMARY     ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN3_SECUNDARY   ((uint32_t)0x00000008u)

#define DMA_DMACHASGN_CHASGN3_MASK          ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN3_PRIMARY       ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN3_SECUNDARY     ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN4_MASK        ((uint32_t)0x00000010u)
#define DMA_DMACHASGN_R_CHASGN4_BIT         ((uint32_t)4u)
#define DMA_DMACHASGN_R_CHASGN4_PRIMARY     ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN4_SECUNDARY   ((uint32_t)0x00000010u)

#define DMA_DMACHASGN_CHASGN4_MASK          ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN4_PRIMARY       ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN4_SECUNDARY     ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN5_MASK        ((uint32_t)0x00000020u)
#define DMA_DMACHASGN_R_CHASGN5_BIT         ((uint32_t)5u)
#define DMA_DMACHASGN_R_CHASGN5_PRIMARY     ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN5_SECUNDARY   ((uint32_t)0x00000020u)

#define DMA_DMACHASGN_CHASGN5_MASK          ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN5_PRIMARY       ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN5_SECUNDARY     ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN6_MASK        ((uint32_t)0x00000040u)
#define DMA_DMACHASGN_R_CHASGN6_BIT         ((uint32_t)6u)
#define DMA_DMACHASGN_R_CHASGN6_PRIMARY     ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN6_SECUNDARY   ((uint32_t)0x00000040u)

#define DMA_DMACHASGN_CHASGN6_MASK          ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN6_PRIMARY       ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN6_SECUNDARY     ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN7_MASK        ((uint32_t)0x00000080u)
#define DMA_DMACHASGN_R_CHASGN7_BIT         ((uint32_t)7u)
#define DMA_DMACHASGN_R_CHASGN7_PRIMARY     ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN7_SECUNDARY   ((uint32_t)0x00000080u)

#define DMA_DMACHASGN_CHASGN7_MASK          ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN7_PRIMARY       ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN7_SECUNDARY     ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN8_MASK        ((uint32_t)0x00000100u)
#define DMA_DMACHASGN_R_CHASGN8_BIT         ((uint32_t)8u)
#define DMA_DMACHASGN_R_CHASGN8_PRIMARY     ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN8_SECUNDARY   ((uint32_t)0x00000100u)

#define DMA_DMACHASGN_CHASGN8_MASK          ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN8_PRIMARY       ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN8_SECUNDARY     ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN9_MASK        ((uint32_t)0x00000200u)
#define DMA_DMACHASGN_R_CHASGN9_BIT         ((uint32_t)9u)
#define DMA_DMACHASGN_R_CHASGN9_PRIMARY     ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN9_SECUNDARY   ((uint32_t)0x00000200u)

#define DMA_DMACHASGN_CHASGN9_MASK          ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN9_PRIMARY       ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN9_SECUNDARY     ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN10_MASK       ((uint32_t)0x00000400u)
#define DMA_DMACHASGN_R_CHASGN10_BIT        ((uint32_t)10u)
#define DMA_DMACHASGN_R_CHASGN10_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN10_SECUNDARY  ((uint32_t)0x00000400u)

#define DMA_DMACHASGN_CHASGN10_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN10_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN10_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN11_MASK       ((uint32_t)0x00000800u)
#define DMA_DMACHASGN_R_CHASGN11_BIT        ((uint32_t)11u)
#define DMA_DMACHASGN_R_CHASGN11_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN11_SECUNDARY  ((uint32_t)0x00000800u)

#define DMA_DMACHASGN_CHASGN11_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN11_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN11_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN12_MASK       ((uint32_t)0x00001000u)
#define DMA_DMACHASGN_R_CHASGN12_BIT        ((uint32_t)12u)
#define DMA_DMACHASGN_R_CHASGN12_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN12_SECUNDARY  ((uint32_t)0x00001000u)

#define DMA_DMACHASGN_CHASGN12_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN12_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN12_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN13_MASK       ((uint32_t)0x00002000u)
#define DMA_DMACHASGN_R_CHASGN13_BIT        ((uint32_t)13u)
#define DMA_DMACHASGN_R_CHASGN13_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN13_SECUNDARY  ((uint32_t)0x00002000u)

#define DMA_DMACHASGN_CHASGN13_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN13_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN13_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN14_MASK       ((uint32_t)0x00004000u)
#define DMA_DMACHASGN_R_CHASGN14_BIT        ((uint32_t)14u)
#define DMA_DMACHASGN_R_CHASGN14_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN14_SECUNDARY  ((uint32_t)0x00004000u)

#define DMA_DMACHASGN_CHASGN14_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN14_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN14_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN15_MASK       ((uint32_t)0x00008000u)
#define DMA_DMACHASGN_R_CHASGN15_BIT        ((uint32_t)15u)
#define DMA_DMACHASGN_R_CHASGN15_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN15_SECUNDARY  ((uint32_t)0x00008000u)

#define DMA_DMACHASGN_CHASGN15_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN15_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN15_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN16_MASK       ((uint32_t)0x00010000u)
#define DMA_DMACHASGN_R_CHASGN16_BIT        ((uint32_t)16u)
#define DMA_DMACHASGN_R_CHASGN16_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN16_SECUNDARY  ((uint32_t)0x00010000u)

#define DMA_DMACHASGN_CHASGN16_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN16_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN16_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN17_MASK       ((uint32_t)0x00020000u)
#define DMA_DMACHASGN_R_CHASGN17_BIT        ((uint32_t)17u)
#define DMA_DMACHASGN_R_CHASGN17_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN17_SECUNDARY  ((uint32_t)0x00020000u)

#define DMA_DMACHASGN_CHASGN17_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN17_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN17_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN18_MASK       ((uint32_t)0x00040000u)
#define DMA_DMACHASGN_R_CHASGN18_BIT        ((uint32_t)18u)
#define DMA_DMACHASGN_R_CHASGN18_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN18_SECUNDARY  ((uint32_t)0x00040000u)

#define DMA_DMACHASGN_CHASGN18_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN18_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN18_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN19_MASK       ((uint32_t)0x00080000u)
#define DMA_DMACHASGN_R_CHASGN19_BIT        ((uint32_t)19u)
#define DMA_DMACHASGN_R_CHASGN19_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN19_SECUNDARY  ((uint32_t)0x00080000u)

#define DMA_DMACHASGN_CHASGN19_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN19_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN19_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN20_MASK       ((uint32_t)0x00100000u)
#define DMA_DMACHASGN_R_CHASGN20_BIT        ((uint32_t)20u)
#define DMA_DMACHASGN_R_CHASGN20_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN20_SECUNDARY  ((uint32_t)0x00100000u)

#define DMA_DMACHASGN_CHASGN20_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN20_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN20_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN21_MASK       ((uint32_t)0x00200000u)
#define DMA_DMACHASGN_R_CHASGN21_BIT        ((uint32_t)21u)
#define DMA_DMACHASGN_R_CHASGN21_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN21_SECUNDARY  ((uint32_t)0x00200000u)

#define DMA_DMACHASGN_CHASGN21_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN21_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN21_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN22_MASK       ((uint32_t)0x00400000u)
#define DMA_DMACHASGN_R_CHASGN22_BIT        ((uint32_t)22u)
#define DMA_DMACHASGN_R_CHASGN22_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN22_SECUNDARY  ((uint32_t)0x00400000u)

#define DMA_DMACHASGN_CHASGN22_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN22_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN22_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN23_MASK       ((uint32_t)0x00800000u)
#define DMA_DMACHASGN_R_CHASGN23_BIT        ((uint32_t)23u)
#define DMA_DMACHASGN_R_CHASGN23_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN23_SECUNDARY  ((uint32_t)0x00800000u)

#define DMA_DMACHASGN_CHASGN23_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN23_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN23_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN24_MASK       ((uint32_t)0x01000000u)
#define DMA_DMACHASGN_R_CHASGN24_BIT        ((uint32_t)24u)
#define DMA_DMACHASGN_R_CHASGN24_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN24_SECUNDARY  ((uint32_t)0x01000000u)

#define DMA_DMACHASGN_CHASGN24_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN24_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN24_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN25_MASK       ((uint32_t)0x02000000u)
#define DMA_DMACHASGN_R_CHASGN25_BIT        ((uint32_t)25u)
#define DMA_DMACHASGN_R_CHASGN25_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN25_SECUNDARY  ((uint32_t)0x02000000u)

#define DMA_DMACHASGN_CHASGN25_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN25_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN25_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN26_MASK       ((uint32_t)0x04000000u)
#define DMA_DMACHASGN_R_CHASGN26_BIT        ((uint32_t)26u)
#define DMA_DMACHASGN_R_CHASGN26_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN26_SECUNDARY  ((uint32_t)0x04000000u)

#define DMA_DMACHASGN_CHASGN26_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN26_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN26_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN27_MASK       ((uint32_t)0x08000000u)
#define DMA_DMACHASGN_R_CHASGN27_BIT        ((uint32_t)27u)
#define DMA_DMACHASGN_R_CHASGN27_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN27_SECUNDARY  ((uint32_t)0x08000000u)

#define DMA_DMACHASGN_CHASGN27_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN27_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN27_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN28_MASK       ((uint32_t)0x10000000u)
#define DMA_DMACHASGN_R_CHASGN28_BIT        ((uint32_t)28u)
#define DMA_DMACHASGN_R_CHASGN28_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN28_SECUNDARY  ((uint32_t)0x10000000u)

#define DMA_DMACHASGN_CHASGN28_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN28_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN28_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN29_MASK       ((uint32_t)0x20000000u)
#define DMA_DMACHASGN_R_CHASGN29_BIT        ((uint32_t)29u)
#define DMA_DMACHASGN_R_CHASGN29_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN29_SECUNDARY  ((uint32_t)0x20000000u)

#define DMA_DMACHASGN_CHASGN29_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN29_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN29_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN30_MASK       ((uint32_t)0x40000000u)
#define DMA_DMACHASGN_R_CHASGN30_BIT        ((uint32_t)30u)
#define DMA_DMACHASGN_R_CHASGN30_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN30_SECUNDARY  ((uint32_t)0x40000000u)

#define DMA_DMACHASGN_CHASGN30_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN30_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN30_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHASGN_R_CHASGN31_MASK       ((uint32_t)0x80000000u)
#define DMA_DMACHASGN_R_CHASGN31_BIT        ((uint32_t)31u)
#define DMA_DMACHASGN_R_CHASGN31_PRIMARY    ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_R_CHASGN31_SECUNDARY  ((uint32_t)0x80000000u)

#define DMA_DMACHASGN_CHASGN31_MASK         ((uint32_t)0x00000001u)
#define DMA_DMACHASGN_CHASGN31_PRIMARY      ((uint32_t)0x00000000u)
#define DMA_DMACHASGN_CHASGN31_SECUNDARY    ((uint32_t)0x00000001u)
/*--------*/

#endif /* XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERDEFINES_DMA_REGISTERDEFINES_CHASGN_H_ */
